УТ/src/Catalogs/АУ_Уведомления/АУ_Уведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АУ_Уведомления</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.АУ_ВидыУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВыполнения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияОФайле</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СобытияОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСобытия</name>
      <type>
        <types>EnumRef.АУ_ВидыСобытийОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Enums/АУ_ВидыУведомлений/АУ_ВидыУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АУ_ВидыУведомлений</name>
  <enumValues>
    <name>ПоРасписанию</name>
  </enumValues>
  <enumValues>
    <name>ПоСобытиям</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/АУ_Уведомления/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		
		СправочникОбъект = РеквизитФормыВЗначение("Объект");
		
		Данные = СправочникОбъект.Настройки.Получить();
		Если НЕ Данные = Неопределено Тогда
			АдресХранилищаНастроек = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
		КонецЕсли;
		
		ДвоичныеДанные = СправочникОбъект.ОбработкаВыполнения.Получить();
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			АдресХранилищаОбработкиВыполнения = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаНастроек) Тогда
		Данные = ПолучитьИзВременногоХранилища(АдресХранилищаНастроек);
		Если НЕ Данные = Неопределено Тогда
			ТекущийОбъект.Настройки = Новый ХранилищеЗначения(Данные);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаОбработкиВыполнения) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилищаОбработкиВыполнения);
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			ТекущийОбъект.ОбработкаВыполнения = Новый ХранилищеЗначения(ДвоичныеДанные);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийОбъект.Ссылка.Пустая() Тогда
		СсылкаНаОбъект = Справочники.АУ_Уведомления.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ТекущийОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
	Иначе
		СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	КонецЕсли;
	
	Попытка
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ТекущийОбъект.ИдентификаторРегламентногоЗадания));
		
		Если Задание = Неопределено И ТекущийОбъект.Использование И ТекущийОбъект.ВидУведомления = Перечисления.АУ_ВидыУведомлений.ПоРасписанию Тогда
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.АУ_ФормированиеУведомленийПоРасписанию);
		ИначеЕсли НЕ Задание = Неопределено И (НЕ ТекущийОбъект.Использование ИЛИ НЕ ТекущийОбъект.ВидУведомления = Перечисления.АУ_ВидыУведомлений.ПоРасписанию) Тогда
			Задание.Удалить();
		КонецЕсли;
		
	Исключение
		
		Если ТекущийОбъект.Использование И ТекущийОбъект.ВидУведомления = Перечисления.АУ_ВидыУведомлений.ПоРасписанию Тогда
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.АУ_ФормированиеУведомленийПоРасписанию);
		КонецЕсли;
		
	КонецПопытки;
	
	Если ТекущийОбъект.Использование И ТекущийОбъект.ВидУведомления = Перечисления.АУ_ВидыУведомлений.ПоРасписанию Тогда
		
		Задание.Использование = ТекущийОбъект.Использование;
		Задание.Ключ = Новый УникальныйИдентификатор;
		Задание.Наименование = СтрШаблон("%1 (%2(%3))", Метаданные.РегламентныеЗадания.АУ_ФормированиеУведомленийПоРасписанию.Синоним, ТекущийОбъект.Наименование, ТекущийОбъект.Код);
		Задание.Расписание = СтрокаВРасписание(ТекущееРасписание);
		Задание.Параметры.Очистить();
		Задание.Параметры.Добавить(СсылкаНаОбъект);
		Задание.Записать();
		
		ТекущийОбъект.ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗагрузитьОбработкуСДиска(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файлы EPF *.epf|*.epf";
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьОбработкуСДискаЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбработкуСДискаЗавершение(Значение, ДопПараметры) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Массив") И Значение.Количество() > 0 Тогда
		
		Файл = Новый Файл(Значение[0]);
		Объект.ИмяФайлаОбработки = Файл.Имя;
		Объект.ИнформацияОФайле = СтрШаблон("%1, изменен %2, размер %3 бт", Файл.Имя, Файл.ПолучитьВремяИзменения(), Файл.Размер());
		АдресХранилищаОбработкиВыполнения = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Значение[0]), УникальныйИдентификатор);
		
		ЗагрузитьНастройкиУведмленийИзОбработки();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОбработкуНаДиск(Команда)
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресХранилищаОбработкиВыполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "Файлы EPF *.epf|*.epf";
	Диалог.ПолноеИмяФайла = Объект.ИмяФайлаОбработки;
	Диалог.Показать(Новый ОписаниеОповещения("СохранитьОбработкуНаДискЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОбработкуНаДискЗавершение(Значение, ДопПараметры) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Массив") И Значение.Количество() > 0 Тогда
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилищаОбработкиВыполнения);
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанные.Записать(Значение[0]);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	Обработчик = Новый ОписаниеОповещения("ОткрытьНастройкиПослеПодтвержденияЗаписи", ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Для открытия настроек запишите данные.'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ЗаписатьИПродолжить", НСтр("ru = 'Записать и продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
		
	Иначе
		ВыполнитьОбработкуОповещения(Обработчик, "ПродолжитьБезЗаписи");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиПослеПодтвержденияЗаписи(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = "ЗаписатьИПродолжить" Тогда
		
		ОчиститьСообщения();
		
		Если Не Записать() Тогда
			Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
		КонецЕсли;
		
	ИначеЕсли Ответ <> "ПродолжитьБезЗаписи" Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		Возврат; // Финальная проверка.
	КонецЕсли;
	
	ИмяОбработки = АУ_Уведомления.ПодключитьОбработкуВыполнения(Объект.Ссылка);
	
	ОбработчикЗавершенияНастройки = Новый ОписаниеОповещения("ПриЗавершенииНастройки", ЭтотОбъект);
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("АдресНастроек", АдресХранилищаНастроек);
	ПараметрыОбработки.Вставить("ИдентификаторВладельца", УникальныйИдентификатор);
	
	Попытка
		ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаНастроек", 
									ПараметрыОбработки, 
									ЭтаФорма,
									,
									,
									, 
									ОбработчикЗавершенияНастройки,
									РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		Сообщить("Во обработке выполнения отсутствует форма настроек !");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииНастройки(Настройки, ДопПараметры) Экспорт

	Если НЕ Настройки = Неопределено И ТипЗнч(Настройки) = Тип("Структура") И Настройки.Свойство("АдресНастроек") Тогда
		АдресХранилищаНастроек = Настройки.АдресНастроек;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонОбработкиВыполненияНаДиск(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "Файлы EPF *.epf|*.epf";
	Диалог.ПолноеИмяФайла = "ШаблонОбработкиВыполнения.epf";
	Диалог.Показать(Новый ОписаниеОповещения("СохранитьШаблонОбработкиВыполненияНаДискЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблонОбработкиВыполненияНаДискЗавершение(Значение, ДопПараметры) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Массив") И Значение.Количество() > 0 Тогда
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПолучитьШаблонОбработкиВыполнения());
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			ДвоичныеДанные.Записать(Значение[0]);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУведомления(Команда)
	
	Обработчик = Новый ОписаниеОповещения("СформироватьУведомленияПослеПодтвержденияЗаписи", ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Для формирования уведомлений запишите данные.'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ЗаписатьИПродолжить", НСтр("ru = 'Записать и продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
		
	Иначе
		ВыполнитьОбработкуОповещения(Обработчик, "ПродолжитьБезЗаписи");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУведомленияПослеПодтвержденияЗаписи(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = "ЗаписатьИПродолжить" Тогда
		
		ОчиститьСообщения();
		
		Если Не Записать() Тогда
			Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
		КонецЕсли;
		
	ИначеЕсли Ответ <> "ПродолжитьБезЗаписи" Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		Возврат; // Финальная проверка.
	КонецЕсли;
	
	АУ_Уведомления.ФормированиеУведомлений(Объект.Ссылка, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидУведомленияПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРасписанияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(СтрокаВРасписание(ТекущееРасписание));
	РедактированиеРасписания.Показать(Новый ОписаниеОповещения("ПослеОкончанияРедактированияРасписания", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияРедактированияРасписания(Расписание, Контекст) Экспорт
	
	Если Расписание = Неопределено Тогда
		
	Иначе
		
		ПредставлениеРасписания = Строка(Расписание);
		ТекущееРасписание = РасписаниеВСтроку(Расписание);
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	Попытка
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Объект.ИдентификаторРегламентногоЗадания));
		ПредставлениеРасписания = Строка(Задание.Расписание);
		ТекущееРасписание = РасписаниеВСтроку(Задание.Расписание);
	Исключение
		ПредставлениеРасписания = "<установить расписание>";
	КонецПопытки;
	
	Элементы.ПредставлениеРасписания.Видимость = (Объект.ВидУведомления = Перечисления.АУ_ВидыУведомлений.ПоРасписанию);
	Элементы.ГруппаСобытияОбъектов.Видимость = (Объект.ВидУведомления = Перечисления.АУ_ВидыУведомлений.ПоСобытиям);
	Элементы.СформироватьУведомления.Видимость = (Объект.ВидУведомления = Перечисления.АУ_ВидыУведомлений.ПоРасписанию);
	
КонецПроцедуры

&НаСервере
Функция РасписаниеВСтроку(Расписание) Экспорт
	
	Если Строка(Расписание) = "один день; один раз в день" Тогда
		Возврат "";
	Иначе
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Расписание);
		
		Возврат ЗаписьXML.Закрыть();
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СтрокаВРасписание(СтрокаРасписания) Экспорт
	
	Если СтрокаРасписания = "" Тогда 
		Возврат Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Попытка
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СтрокаРасписания);
		Расписание = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("РасписаниеРегламентногоЗадания"));
		
	Исключение
		Расписание = Новый РасписаниеРегламентногоЗадания;
	КонецПопытки;

	Возврат Расписание;
	
КонецФункции

&НаСервере
Функция ПолучитьШаблонОбработкиВыполнения()
	
	Возврат ПоместитьВоВременноеХранилище(Справочники.АУ_Уведомления.ПолучитьМакет("ШаблонОбработкиВыполнения"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиУведмленийИзОбработки()
	
	Попытка
		
		ИмяОбработки = ВнешниеОбработки.Подключить(АдресХранилищаОбработкиВыполнения, , Ложь,
			ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
			
		Обработка = ВнешниеОбработки.Создать(ИмяОбработки);
		
		НастройкиУведомления = Обработка.НастройкиУведомлений();
		
		Если НастройкиУведомления.Свойство("ВидУведомления") И ЗначениеЗаполнено(НастройкиУведомления.ВидУведомления) Тогда
			Объект.ВидУведомления = НастройкиУведомления.ВидУведомления;
			НастроитьВидимостьДоступность();
		КонецЕсли;
		
		Если НастройкиУведомления.Свойство("СобытияОбъектов") И НЕ НастройкиУведомления.СобытияОбъектов = Неопределено Тогда
			Объект.СобытияОбъектов.Загрузить(НастройкиУведомления.СобытияОбъектов);
		КонецЕсли;
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Ошибка применения настроек обработки ! %1%2", Символы.ПС, ТекстОшибки));
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
